RIET/src/Documents/rgsBudgetPercentage/rgsBudgetPercentage.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>rgsBudgetPercentage</name>
  <registerRecords>InformationRegister.rgsBudgetPercentage</registerRecords>
  <attributes>
    <name>BudgetType</name>
    <type>
      <types>CatalogRef.rgsBudgetType</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>InternationalDomestic</name>
    <attributes>
      <name>BudgetItem</name>
      <type>
        <types>CatalogRef.rgsBudgetItem</types>
      </type>
    </attributes>
    <attributes>
      <name>Group_Level</name>
      <type>
        <types>CatalogRef.GeoMarkets</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Sub_Geomarket</name>
    <attributes>
      <name>BudgetItem</name>
      <type>
        <types>CatalogRef.rgsBudgetItem</types>
      </type>
    </attributes>
    <attributes>
      <name>Group_Level</name>
      <type>
        <types>CatalogRef.GeoMarkets</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Sub_Segment</name>
    <attributes>
      <name>BudgetItem</name>
      <type>
        <types>CatalogRef.rgsBudgetItem</types>
      </type>
    </attributes>
    <attributes>
      <name>Group_Level</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SubGeo_Segment</name>
    <attributes>
      <name>BudgetItem</name>
      <type>
        <types>CatalogRef.rgsBudgetItem</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RevenueProcent</name>
    <attributes>
      <name>BudgetItem</name>
      <type>
        <types>CatalogRef.rgsBudgetItem</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>GeomarketSegment</name>
    <attributes>
      <name>Percent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BudgetItem</name>
      <type>
        <types>CatalogRef.rgsBudgetItem</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Enums/rgsBudgetPercentTypes/rgsBudgetPercentTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>rgsBudgetPercentTypes</name>
  <enumValues>
    <name>InternationalDomestic</name>
  </enumValues>
  <enumValues>
    <name>Sub_Geomarket</name>
  </enumValues>
  <enumValues>
    <name>Sub_Segment</name>
  </enumValues>
  <enumValues>
    <name>SubGeomarket_Segment</name>
  </enumValues>
  <enumValues>
    <name>Geomarket_Segment</name>
  </enumValues>
  <enumValues>
    <name>RevenueProcent</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/rgsBudgetItem/rgsBudgetItem.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>rgsBudgetItem</name>
  <attributes>
    <name>BudgetPercentType</name>
    <type>
      <types>EnumRef.rgsBudgetPercentTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupLevel</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
      <types>CatalogRef.rgsBudgetItem</types>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubLevel</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
      <types>EnumRef.DomesticInternational</types>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Documents/rgsBudgetPercentage/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьПоВидамБюджетированияНаСервере()
		
	Объект.InternationalDomestic.Очистить();
	Объект.Sub_Geomarket.Очистить();
	Объект.Sub_Segment.Очистить();
	Объект.SubGeo_Segment.Очистить();
	Объект.RevenueProcent.Очистить();
	Объект.GeomarketSegment.Очистить();
	
	Выборка = Справочники.rgsBudgetItem.Выбрать();
	
	Пока Выборка.Следующий() цикл
		
		Если не Выборка.ПометкаУдаления тогда
			
			Если  Выборка.BudgetPercentType = Перечисления.rgsBudgetPercentTypes.InternationalDomestic тогда
				Строка = Объект.InternationalDomestic.Добавить();
				Строка.Group_Level = Выборка.GroupLevel;
				Строка.BudgetItem = Выборка.Ссылка;
			ИначеЕсли Выборка.BudgetPercentType = Перечисления.rgsBudgetPercentTypes.Sub_Geomarket тогда
				Строка = Объект.Sub_Geomarket.Добавить();
				Строка.BudgetItem = Выборка.Ссылка;
				Строка.Group_Level = Выборка.GroupLevel;
			ИначеЕсли Выборка.BudgetPercentType = Перечисления.rgsBudgetPercentTypes.Sub_Segment тогда
				Строка = Объект.Sub_Segment.Добавить();
				Строка.BudgetItem = Выборка.Ссылка;
				Строка.Group_Level = Выборка.GroupLevel;
			ИначеЕсли Выборка.BudgetPercentType = Перечисления.rgsBudgetPercentTypes.RevenueProcent тогда
				Строка = Объект.RevenueProcent.Добавить();
				Строка.BudgetItem = Выборка.Ссылка;
			ИначеЕсли Выборка.BudgetPercentType = Перечисления.rgsBudgetPercentTypes.Geomarket_Segment тогда
				Строка = Объект.GeomarketSegment.Добавить();
				Строка.BudgetItem = Выборка.Ссылка;
			Иначе
				Строка = Объект.SubGeo_Segment.Добавить();
				Строка.BudgetItem = Выборка.Ссылка;				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоВидамБюджетирования(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(НСтр("ru = 'Табличные части будут перезаполнены. Продолжить?';"
	+ " en = 'Do you want to continue?'"), Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоВидамБюджетированияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура InternationalDomesticBudgetItemПриИзменении(Элемент)
	InternationalDomesticBudgetItemПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура InternationalDomesticBudgetItemПриИзмененииНаСервере()
	Для каждого СтрокаInternationalDomestic из Объект.InternationalDomestic цикл
		СтрокаInternationalDomestic.Group_Level = СтрокаInternationalDomestic.BudgetItem.GroupLevel;
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура Sub_GeomarketBudgetItemПриИзменении(Элемент)
	Sub_GeomarketBudgetItemПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Sub_GeomarketBudgetItemПриИзмененииНаСервере()
	Для каждого СтрокаSub_Geomarket из Объект.Sub_Geomarket цикл
		СтрокаSub_Geomarket.Group_Level = СтрокаSub_Geomarket.BudgetItem.GroupLevel;
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура Sub_SegmentBudgetItemПриИзменении(Элемент)
	Sub_SegmentBudgetItemПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Sub_SegmentBudgetItemПриИзмененииНаСервере()
	Для каждого СтрокаSub_Segment из Объект.Sub_Segment цикл
		СтрокаSub_Segment.Group_Level = СтрокаSub_Segment.BudgetItem.Sublevel;
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура InternationalDomesticBudgetItemНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Тип = ВернутьТипПроцентаInternationalDomestic();
	Отбор = Новый Структура();
	Отбор.Вставить("BudgetPercentType", Тип);	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.rgsBudgetItem.ФормаВыбора", ПараметрыОткрытия, Элемент);
	
КонецПроцедуры

&НаСервере
Функция ВернутьТипПроцентаInternationalDomestic()
Возврат Перечисления.rgsBudgetPercentTypes.InternationalDomestic	
КонецФункции

&НаКлиенте
Процедура Sub_GeomarketBudgetItemНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Тип = ВернутьТипПроцентаSub_Geomarket();
	Отбор = Новый Структура();
	Отбор.Вставить("BudgetPercentType", Тип);	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.rgsBudgetItem.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

&НаСервере
Функция ВернутьТипПроцентаSub_Geomarket()
Возврат Перечисления.rgsBudgetPercentTypes.Sub_Geomarket	
КонецФункции

&НаКлиенте
Процедура Sub_SegmentBudgetItemНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Тип = ВернутьТипПроцентаSub_Segment();
	Отбор = Новый Структура();
	Отбор.Вставить("BudgetPercentType", Тип);	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.rgsBudgetItem.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

&НаСервере
Функция ВернутьТипПроцентаSub_Segment()
Возврат Перечисления.rgsBudgetPercentTypes.Sub_Segment	
КонецФункции

&НаКлиенте
Процедура SubGeo_SegmentItem_GeoПриИзменении(Элемент)
	SubGeo_SegmentItem_GeoПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура SubGeo_SegmentItem_GeoПриИзмененииНаСервере()
	Для каждого Строка из Объект.SubGeo_Segment цикл
		Строка.SubGeo = Строка.Item_Geo.SubLevel;
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура SubGeo_SegmentItem_SegmentПриИзменении(Элемент)
	SubGeo_SegmentItem_SegmentПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура SubGeo_SegmentItem_SegmentПриИзмененииНаСервере()	
	Для каждого Строка из Объект.SubGeo_Segment цикл
		Строка.Segment = Строка.Item_Segment.GroupLevel;
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура SubGeo_SegmentItem_GeoНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Тип = ВернутьТипПроцентаSub_Geomarket();
	Отбор = Новый Структура();
	Отбор.Вставить("BudgetPercentType", Тип);	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.rgsBudgetItem.ФормаВыбора", ПараметрыОткрытия, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура SubGeo_SegmentItem_SegmentНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Тип = ВернутьТипПроцентаSub_Segment();
	Отбор = Новый Структура();
	Отбор.Вставить("BudgetPercentType", Тип);	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.rgsBudgetItem.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура SubGeo_SegmentBudgetItemНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Тип = ВернутьТипПроцентаSubGeomarket_Segment();
	Отбор = Новый Структура();
	Отбор.Вставить("BudgetPercentType", Тип);	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.rgsBudgetItem.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

&НаСервере
Функция ВернутьТипПроцентаSubGeomarket_Segment()
Возврат Перечисления.rgsBudgetPercentTypes.SubGeomarket_Segment	
КонецФункции

&НаКлиенте
Процедура RevenueProcentBudgetItemНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Тип = ВернутьТипПроцентаRevenueProcent();
	Отбор = Новый Структура();
	Отбор.Вставить("BudgetPercentType", Тип);	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.rgsBudgetItem.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

&НаСервере
Функция ВернутьТипПроцентаRevenueProcent()
Возврат Перечисления.rgsBudgetPercentTypes.RevenueProcent	
КонецФункции

&НаКлиенте
Процедура GeomarketSegmentBudgetItemНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Тип = ВернутьТипПроцентаGeomarketSegment();
	Отбор = Новый Структура();
	Отбор.Вставить("BudgetPercentType", Тип);	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	ОткрытьФорму("Справочник.rgsBudgetItem.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

&НаСервере
Функция ВернутьТипПроцентаGeomarketSegment()
Возврат Перечисления.rgsBudgetPercentTypes.Geomarket_Segment	
КонецФункции
